zephyrproject-rtos/zephyr/ext/hal/cypress/PDL/3.1.0/devices/psoc6/include/gpio_psoc6a2m_124_bga.h
    /* P2.6 */
    P2_6_GPIO                       =  0,       /* GPIO controls 'out' */
    P2_6_AMUXA                      =  4,       /* Analog mux bus A */
    P2_6_AMUXB                      =  5,       /* Analog mux bus B */
    P2_6_AMUXA_DSI                  =  6,       /* Analog mux bus A, DSI control */
    P2_6_AMUXB_DSI                  =  7,       /* Analog mux bus B, DSI control */
    P2_6_TCPWM0_LINE1               =  8,       /* Digital Active - tcpwm[0].line[1]:5 */
    P2_6_TCPWM1_LINE18              =  9,       /* Digital Active - tcpwm[1].line[18]:1 */
    P2_6_CSD_CSD_TX                 = 10,       /* Digital Active - csd.csd_tx:18 */
    P2_6_CSD_CSD_TX_N               = 11,       /* Digital Active - csd.csd_tx_n:18 */
    P2_6_LCD_COM18                  = 12,       /* Digital Deep Sleep - lcd.com[18]:0 */
    P2_6_LCD_SEG18                  = 13,       /* Digital Deep Sleep - lcd.seg[18]:0 */
    P2_6_SCB9_UART_RTS              = 18,       /* Digital Active - scb[9].uart_rts:0 */
    P2_6_SCB1_SPI_SELECT3           = 20,       /* Digital Active - scb[1].spi_select3:0 */
    P2_6_SDHC0_CARD_DETECT_N        = 26,       /* Digital Active - sdhc[0].card_detect_n */

    /* P2.7 */
    P2_7_GPIO                       =  0,       /* GPIO controls 'out' */
    P2_7_AMUXA                      =  4,       /* Analog mux bus A */
    P2_7_AMUXB                      =  5,       /* Analog mux bus B */
    P2_7_AMUXA_DSI                  =  6,       /* Analog mux bus A, DSI control */
    P2_7_AMUXB_DSI                  =  7,       /* Analog mux bus B, DSI control */
    P2_7_TCPWM0_LINE_COMPL1         =  8,       /* Digital Active - tcpwm[0].line_compl[1]:5 */
    P2_7_TCPWM1_LINE_COMPL18        =  9,       /* Digital Active - tcpwm[1].line_compl[18]:1 */
    P2_7_CSD_CSD_TX                 = 10,       /* Digital Active - csd.csd_tx:19 */
    P2_7_CSD_CSD_TX_N               = 11,       /* Digital Active - csd.csd_tx_n:19 */
    P2_7_LCD_COM19                  = 12,       /* Digital Deep Sleep - lcd.com[19]:0 */
    P2_7_LCD_SEG19                  = 13,       /* Digital Deep Sleep - lcd.seg[19]:0 */
    P2_7_SCB9_UART_CTS              = 18,       /* Digital Active - scb[9].uart_cts:0 */
    P2_7_SDHC0_CARD_MECH_WRITE_PROT = 26,       /* Digital Active - sdhc[0].card_mech_write_prot */

    /* P3.0 */
    P3_0_GPIO                       =  0,       /* GPIO controls 'out' */
    P3_0_AMUXA                      =  4,       /* Analog mux bus A */
    P3_0_AMUXB                      =  5,       /* Analog mux bus B */
    P3_0_AMUXA_DSI                  =  6,       /* Analog mux bus A, DSI control */
    P3_0_AMUXB_DSI                  =  7,       /* Analog mux bus B, DSI control */
    P3_0_TCPWM0_LINE2               =  8,       /* Digital Active - tcpwm[0].line[2]:5 */
    P3_0_TCPWM1_LINE19              =  9,       /* Digital Active - tcpwm[1].line[19]:1 */
    P3_0_CSD_CSD_TX                 = 10,       /* Digital Active - csd.csd_tx:20 */
    P3_0_CSD_CSD_TX_N               = 11,       /* Digital Active - csd.csd_tx_n:20 */
    P3_0_LCD_COM20                  = 12,       /* Digital Deep Sleep - lcd.com[20]:0 */
    P3_0_LCD_SEG20                  = 13,       /* Digital Deep Sleep - lcd.seg[20]:0 */
    P3_0_SCB2_UART_RX               = 18,       /* Digital Active - scb[2].uart_rx:1 */
    P3_0_SCB2_I2C_SCL               = 19,       /* Digital Active - scb[2].i2c_scl:1 */
    P3_0_SCB2_SPI_MOSI              = 20,       /* Digital Active - scb[2].spi_mosi:1 */
    P3_0_PERI_TR_IO_INPUT6          = 24,       /* Digital Active - peri.tr_io_input[6]:0 */
    P3_0_SDHC0_IO_VOLT_SEL          = 26,       /* Digital Active - sdhc[0].io_volt_sel */

    /* P3.1 */
    P3_1_GPIO                       =  0,       /* GPIO controls 'out' */
    P3_1_AMUXA                      =  4,       /* Analog mux bus A */
    P3_1_AMUXB                      =  5,       /* Analog mux bus B */
    P3_1_AMUXA_DSI                  =  6,       /* Analog mux bus A, DSI control */
    P3_1_AMUXB_DSI                  =  7,       /* Analog mux bus B, DSI control */
    P3_1_TCPWM0_LINE_COMPL2         =  8,       /* Digital Active - tcpwm[0].line_compl[2]:5 */
    P3_1_TCPWM1_LINE_COMPL19        =  9,       /* Digital Active - tcpwm[1].line_compl[19]:1 */
    P3_1_CSD_CSD_TX                 = 10,       /* Digital Active - csd.csd_tx:21 */
    P3_1_CSD_CSD_TX_N               = 11,       /* Digital Active - csd.csd_tx_n:21 */
    P3_1_LCD_COM21                  = 12,       /* Digital Deep Sleep - lcd.com[21]:0 */
    P3_1_LCD_SEG21                  = 13,       /* Digital Deep Sleep - lcd.seg[21]:0 */
    P3_1_SCB2_UART_TX               = 18,       /* Digital Active - scb[2].uart_tx:1 */
    P3_1_SCB2_I2C_SDA               = 19,       /* Digital Active - scb[2].i2c_sda:1 */
    P3_1_SCB2_SPI_MISO              = 20,       /* Digital Active - scb[2].spi_miso:1 */
    P3_1_PERI_TR_IO_INPUT7          = 24,       /* Digital Active - peri.tr_io_input[7]:0 */
    P3_1_SDHC0_CARD_IF_PWR_EN       = 26,       /* Digital Active - sdhc[0].card_if_pwr_en */

    /* P3.2 */
    P3_2_GPIO                       =  0,       /* GPIO controls 'out' */
    P3_2_AMUXA                      =  4,       /* Analog mux bus A */
    P3_2_AMUXB                      =  5,       /* Analog mux bus B */
    P3_2_AMUXA_DSI                  =  6,       /* Analog mux bus A, DSI control */
    P3_2_AMUXB_DSI                  =  7,       /* Analog mux bus B, DSI control */
    P3_2_TCPWM0_LINE3               =  8,       /* Digital Active - tcpwm[0].line[3]:5 */
    P3_2_TCPWM1_LINE20              =  9,       /* Digital Active - tcpwm[1].line[20]:1 */
    P3_2_CSD_CSD_TX                 = 10,       /* Digital Active - csd.csd_tx:22 */
    P3_2_CSD_CSD_TX_N               = 11,       /* Digital Active - csd.csd_tx_n:22 */
    P3_2_LCD_COM22                  = 12,       /* Digital Deep Sleep - lcd.com[22]:0 */
    P3_2_LCD_SEG22                  = 13,       /* Digital Deep Sleep - lcd.seg[22]:0 */
    P3_2_SCB2_UART_RTS              = 18,       /* Digital Active - scb[2].uart_rts:1 */
    P3_2_SCB2_SPI_CLK               = 20,       /* Digital Active - scb[2].spi_clk:1 */

    /* P3.3 */
    P3_3_GPIO                       =  0,       /* GPIO controls 'out' */
    P3_3_AMUXA                      =  4,       /* Analog mux bus A */
    P3_3_AMUXB                      =  5,       /* Analog mux bus B */
    P3_3_AMUXA_DSI                  =  6,       /* Analog mux bus A, DSI control */
    P3_3_AMUXB_DSI                  =  7,       /* Analog mux bus B, DSI control */
    P3_3_TCPWM0_LINE_COMPL3         =  8,       /* Digital Active - tcpwm[0].line_compl[3]:5 */
    P3_3_TCPWM1_LINE_COMPL20        =  9,       /* Digital Active - tcpwm[1].line_compl[20]:1 */
    P3_3_CSD_CSD_TX                 = 10,       /* Digital Active - csd.csd_tx:23 */
    P3_3_CSD_CSD_TX_N               = 11,       /* Digital Active - csd.csd_tx_n:23 */
    P3_3_LCD_COM23                  = 12,       /* Digital Deep Sleep - lcd.com[23]:0 */
    P3_3_LCD_SEG23                  = 13,       /* Digital Deep Sleep - lcd.seg[23]:0 */
    P3_3_SCB2_UART_CTS              = 18,       /* Digital Active - scb[2].uart_cts:1 */
    P3_3_SCB2_SPI_SELECT0           = 20,       /* Digital Active - scb[2].spi_select0:1 */

    /* P3.4 */
    P3_4_GPIO                       =  0,       /* GPIO controls 'out' */
    P3_4_AMUXA                      =  4,       /* Analog mux bus A */
    P3_4_AMUXB                      =  5,       /* Analog mux bus B */
    P3_4_AMUXA_DSI                  =  6,       /* Analog mux bus A, DSI control */
    P3_4_AMUXB_DSI                  =  7,       /* Analog mux bus B, DSI control */
    P3_4_TCPWM0_LINE4               =  8,       /* Digital Active - tcpwm[0].line[4]:5 */
    P3_4_TCPWM1_LINE21              =  9,       /* Digital Active - tcpwm[1].line[21]:1 */
    P3_4_CSD_CSD_TX                 = 10,       /* Digital Active - csd.csd_tx:24 */
    P3_4_CSD_CSD_TX_N               = 11,       /* Digital Active - csd.csd_tx_n:24 */
    P3_4_LCD_COM24                  = 12,       /* Digital Deep Sleep - lcd.com[24]:0 */
    P3_4_LCD_SEG24                  = 13,       /* Digital Deep Sleep - lcd.seg[24]:0 */
    P3_4_SCB2_SPI_SELECT1           = 20,       /* Digital Active - scb[2].spi_select1:1 */

    /* P3.5 */
    P3_5_GPIO                       =  0,       /* GPIO controls 'out' */
    P3_5_AMUXA                      =  4,       /* Analog mux bus A */
    P3_5_AMUXB                      =  5,       /* Analog mux bus B */
    P3_5_AMUXA_DSI                  =  6,       /* Analog mux bus A, DSI control */
    P3_5_AMUXB_DSI                  =  7,       /* Analog mux bus B, DSI control */
    P3_5_TCPWM0_LINE_COMPL4         =  8,       /* Digital Active - tcpwm[0].line_compl[4]:5 */
    P3_5_TCPWM1_LINE_COMPL21        =  9,       /* Digital Active - tcpwm[1].line_compl[21]:1 */
    P3_5_CSD_CSD_TX                 = 10,       /* Digital Active - csd.csd_tx:25 */
    P3_5_CSD_CSD_TX_N               = 11,       /* Digital Active - csd.csd_tx_n:25 */
    P3_5_LCD_COM25                  = 12,       /* Digital Deep Sleep - lcd.com[25]:0 */
    P3_5_LCD_SEG25                  = 13,       /* Digital Deep Sleep - lcd.seg[25]:0 */
    P3_5_SCB2_SPI_SELECT2           = 20,       /* Digital Active - scb[2].spi_select2:1 */

    /* P4.0 */
    P4_0_GPIO                       =  0,       /* GPIO controls 'out' */
    P4_0_AMUXA                      =  4,       /* Analog mux bus A */
    P4_0_AMUXB                      =  5,       /* Analog mux bus B */
    P4_0_AMUXA_DSI                  =  6,       /* Analog mux bus A, DSI control */
    P4_0_AMUXB_DSI                  =  7,       /* Analog mux bus B, DSI control */
    P4_0_TCPWM0_LINE5               =  8,       /* Digital Active - tcpwm[0].line[5]:5 */
    P4_0_TCPWM1_LINE22              =  9,       /* Digital Active - tcpwm[1].line[22]:1 */
    P4_0_CSD_CSD_TX                 = 10,       /* Digital Active - csd.csd_tx:26 */
    P4_0_CSD_CSD_TX_N               = 11,       /* Digital Active - csd.csd_tx_n:26 */
    P4_0_LCD_COM26                  = 12,       /* Digital Deep Sleep - lcd.com[26]:0 */
    P4_0_LCD_SEG26                  = 13,       /* Digital Deep Sleep - lcd.seg[26]:0 */
    P4_0_SCB7_UART_RX               = 18,       /* Digital Active - scb[7].uart_rx:1 */
    P4_0_SCB7_I2C_SCL               = 19,       /* Digital Active - scb[7].i2c_scl:1 */
    P4_0_SCB7_SPI_MOSI              = 20,       /* Digital Active - scb[7].spi_mosi:1 */
    P4_0_PERI_TR_IO_INPUT8          = 24,       /* Digital Active - peri.tr_io_input[8]:0 */

